{smcl}
{txt}{sf}{ul off}{.-}
      name:  {res}<unnamed>
       {txt}log:  {res}C:\Users\sabhyag\Documents\Research\Power Calc RR\J-PAL_Power_Code\Sample_Size_and_Power\power_built_in_commands.smcl
  {txt}log type:  {res}smcl
 {txt}opened on:  {res}28 Oct 2021, 16:07:48
{txt}
{com}. 
. use "baroda_0102_1obs.dta", clear                                                                                               //SPECIFY - the dataset
{txt}
{com}. 
. global outcome "pre_totnorm"                                                                                                    //SPECIFY the outcome and treatment variable
{txt}
{com}. global treatment "bal"
{txt}
{com}. 
{txt}end of do-file

{com}. do "C:\Users\sabhyag\AppData\Local\Temp\STD2a8c_000000.tmp"
{txt}
{com}. local power = 0.8                                                                                                                               //SPECIFY - desired power
{txt}
{com}. local nratio = 1                                                                                                                                //SPECIFY - the ratio of experimental group to control group
{txt}
{com}. local alpha =0.05                                                                                                                               //SPECIFY - the significance level
{txt}
{com}. 
.         
. local covariates "female std sessiond"                                                                                  //SPECIFY the covariates - use baseline values of covariates
{txt}
{com}. local number_covariates: word count `covariates'                                                                                                        
{txt}
{com}. 
. regress $outcome `covariates'                                                                                               //SPECIFY outcome and control variables

{txt}      Source {c |}       SS           df       MS      Number of obs   ={res}    10,084
{txt}{hline 13}{c +}{hline 34}   F(3, 10080)     = {res}     7.13
{txt}       Model {c |} {res} 21.7632308         3  7.25441027   {txt}Prob > F        ={res}    0.0001
{txt}    Residual {c |} {res}  10248.808    10,080  1.01674683   {txt}R-squared       ={res}    0.0021
{txt}{hline 13}{c +}{hline 34}   Adj R-squared   ={res}    0.0018
{txt}       Total {c |} {res} 10270.5713    10,083  1.01860272   {txt}Root MSE        =   {res} 1.0083

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1} pre_totnorm{col 14}{c |}      Coef.{col 26}   Std. Err.{col 38}      t{col 46}   P>|t|{col 54}     [95% Con{col 67}f. Interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 6}female {c |}{col 14}{res}{space 2} .0512081{col 26}{space 2} .0203232{col 37}{space 1}    2.52{col 46}{space 3}0.012{col 54}{space 4} .0113706{col 67}{space 3} .0910456
{txt}{space 9}std {c |}{col 14}{res}{space 2}-.0550703{col 26}{space 2} .0200837{col 37}{space 1}   -2.74{col 46}{space 3}0.006{col 54}{space 4}-.0944383{col 67}{space 3}-.0157023
{txt}{space 4}sessiond {c |}{col 14}{res}{space 2}-.0468134{col 26}{space 2} .0199157{col 37}{space 1}   -2.35{col 46}{space 3}0.019{col 54}{space 4} -.085852{col 67}{space 3}-.0077747
{txt}{space 7}_cons {c |}{col 14}{res}{space 2} .2413859{col 26}{space 2} .0784012{col 37}{space 1}    3.08{col 46}{space 3}0.002{col 54}{space 4}  .087704{col 67}{space 3} .3950679
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}{txt}
{com}. 
. local res_sd =round(sqrt(`e(rss)'/`e(df_r)'),0.0001)                                                    //this is the new standard deviation for the power calculation or the residual sd not explained by the control(s). 
{txt}
{com}.                                                                                                                                                                 //This will be used for power calculation.
.         
. quietly sum $outcome if  !missing($outcome)                                                                     //sum the outcome at baseline and record the mean and the standard deviation
{txt}
{com}. local baseline = `r(mean)'
{txt}
{com}. local sd = `r(sd)'
{txt}
{com}. local effect_cov = `sd'*0.3                                                                                                             //SPECIFY - the expected effect. Here we specify 0.3 standard deviations, but this should be updated based on what is reasonable for the study
{txt}
{com}.         
. local treat = `baseline' + `effect_cov'
{txt}
{com}. 
. power twomeans `baseline' `treat', power(`power') sd(`res_sd') nratio(`nratio') alpha(`alpha') table
{res}
{txt}Performing iteration ...
{res}
{p 0 2 2}{txt}Estimated sample sizes for a two-sample means test{p_end}{txt}t test assuming sd1 = sd2 = sd
{txt}{txt}{bind:Ho: m2 = m1}  {txt}versus  {bind:Ha: m2 != m1}

  {txt}{c TLC}{txt}{txt}{hline 8}{txt}{txt}{hline 8}{txt}{txt}{hline 8}{txt}{txt}{hline 8}{txt}{txt}{hline 8}{txt}{txt}{hline 8}{txt}{txt}{hline 8}{txt}{txt}{hline 8}{txt}{txt}{hline 8}{txt}{txt}{hline 8}{txt}{txt}{hline 1}{c TRC}
  {txt}{c |}{txt}{txt}{ralign 8:alpha}{txt}{txt}{ralign 8:power}{txt}{txt}{ralign 8:N}{txt}{txt}{ralign 8:N1}{txt}{txt}{ralign 8:N2}{txt}{txt}{ralign 8:nratio}{txt}{txt}{ralign 8:delta}{txt}{txt}{ralign 8:m1}{txt}{txt}{ralign 8:m2}{txt}{txt}{ralign 8:sd}{txt}{txt} {c |}
  {txt}{c LT}{txt}{txt}{hline 8}{txt}{txt}{hline 8}{txt}{txt}{hline 8}{txt}{txt}{hline 8}{txt}{txt}{hline 8}{txt}{txt}{hline 8}{txt}{txt}{hline 8}{txt}{txt}{hline 8}{txt}{txt}{hline 8}{txt}{txt}{hline 8}{txt}{txt}{hline 1}{c RT}
  {txt}{c |}{res}{ralign 8:.05}{res}{ralign 8:.8}{res}{ralign 8:350}{res}{ralign 8:175}{res}{ralign 8:175}{res}{ralign 8:1}{res}{ralign 8:.3033}{res}{ralign 8:.00393}{res}{ralign 8:.3072}{res}{ralign 8:1.008}{txt} {c |}
  {txt}{c BLC}{txt}{txt}{hline 8}{txt}{txt}{hline 8}{txt}{txt}{hline 8}{txt}{txt}{hline 8}{txt}{txt}{hline 8}{txt}{txt}{hline 8}{txt}{txt}{hline 8}{txt}{txt}{hline 8}{txt}{txt}{hline 8}{txt}{txt}{hline 8}{txt}{txt}{hline 1}{c BRC}

{com}.         
. local effect_cov = round(`effect_cov',0.0001)
{txt}
{com}. local samplesize_cov = `r(N)'
{txt}
{com}.         
. di as error "The minimum sample size needed is `samplesize_cov' to detect an effect of `effect_cov' with a probability of `power' if the effect is true, the ratio of units in treatment and control is `nratio', and the residual standard deviation is `res_sd' after accounting for covariates: `covariates'"
{res}{err}The minimum sample size needed is 350 to detect an effect of .3033 with a probability of .8 if the effect is true, the ratio of units in treatment and control is 1, and the residual standard deviation is 1.0083 after accounting for covariates: female std sessiond
{txt}
{com}. 
.         
. 
{txt}end of do-file

{com}. exit, clear
